tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "hashicorp/tap"

brew "mas" # Mac App Store command-line interface
brew "gh" # GitHub command-line tool
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "git-lfs" # Git extension for versioning large files
brew "coreutils" # Those that come with macOS are outdated
brew "ack" # Search tool like grep, but optimized for programmers
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "jq" # Lightweight and flexible command-line JSON processor
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "svn" # Needed to install fonts
brew "lighttpd" # Small memory footprint, flexible web-server
brew "tmux" # Terminal multiplexer
brew "pre-commit"
brew "tree"
brew "gnu-tar"
brew "terraformer"
brew "terragrunt"
brew "packer"

# Development
brew "python"
brew "openjdk" # Development kit for the Java programming language

brew "php"
brew "php@8.1"
brew "composer"

brew "imagemagick"
brew "meilisearch"
brew "mysql"
brew "nginx"
brew "redis"
brew "openconnect"
brew "hashicorp/tap/terraform"
brew "awscli"
brew "glab"

# Apps
cask "1password" # Password manager that keeps all passwords secure behind one password
cask "1password-cli" # Command-line helper for the 1Password password manager
cask "appcleaner" # Application uninstaller
cask "brave-browser" # Web browser focusing on privacy
cask "sizeup" # Utility to resize and position application windows
cask "soundsource" # Sound and audio controller
cask "steam" # Video game digital distribution service
cask "transmission" # Open-source BitTorrent client
cask "visual-studio-code" # Open-source code editor
cask "tableplus" # Native GUI tool for relational databases
cask "paw" # HTTP client that helps testing and describing APIs
cask "flutter" # UI toolkit for building applications for mobile, web and desktop
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted
cask "android-studio" # Tools for building Android applications
cask "android-commandlinetools" # Command-line tools for building and debugging Android apps
cask "temurin" # JDK from the Eclipse Foundation (Adoptium)
cask "notion" # App to write, plan, collaborate, and get organized
cask "microsoft-teams" # Meet, chat, call, and collaborate in just one place
cask "openvpn-connect" # Client program for the OpenVPN Access Server
cask "whatsapp" # Desktop client for WhatsApp
cask "multipass" # Orchestrates virtual Ubuntu instances

cask "google-chrome"
cask "tinkerwell"
cask "discord"
cask "docker"
cask "telegram-desktop"
cask "the-unarchiver"
cask "tuple"

# Fonts
cask "font-fira-code"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

cask "font-abel"
cask "font-fjalla-one"
cask "font-inter"
cask "font-sf-mono" # Monospaced variant of "San Francisco" by Apple
cask "font-signika" # Sans-serif signage typeface with a gentle character

# Mac App Store
mas "Giphy Capture", id: 668208984
mas "LINE", id: 539883307
mas "BetterSnapTool", id: 417375580
mas "Bear", id: 1091189122
mas "GoodNotes 5", id: 1444383602
# mas "Microsoft Word", id: 462054704
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Excel", id: 462058435
mas "Tomato One", id: 907364780
